package com.example.wei.base;

/**
 * Created by wei on 2019/1/4.
 */

public class GhostParticularsBase {

    /**
     * showapi_res_error :
     * showapi_res_id : a72016b32cfa4fb996a3daeb105ace73
     * showapi_res_code : 0
     * showapi_res_body : {"ret_code":0,"currentPage":"1","text":" 午夜，张宏还在忙碌着。\r\n 他是一名出租车司机，夜半出车早已是家常便饭，这夜，一如既往。\r\n 张宏抽着劣质的兰州烟，等着看有没有搭车的乘客。烟抽到最终，全是淡淡的苦涩味。他朝车窗外咳了一声，吐了浓痰。\r\n 嘭嘭砰砰一阵急促地敲窗声。\r\n 张宏回过头来，是一个女人，女人很年轻，穿着一袭黑衣，很神秘的样子。他扣了一些车门的关卡，门开了，女人上了车。\r\n 去哪？张宏很职业的问道。\r\n 往前开。是女人的回答。\r\n 车启动了，张宏将油门踏到最大，在漆黑的夜中，尽量行驶的更远一点。这样他可以赚到更多的钱，谁叫女人说尽管往前开，不要问！，张宏是个老实人，尽管往前开着耗油。\r\n 北偏坡在这个城市的最北端，很偏僻，尤其是半夜里去那地方，一般出租车司机都不愿意去，因为太过荒凉，也太阴森。贸贸然地，张宏却开到了北偏坡处，连他自己也不知道出于什么原因，自己怎么就开到这儿了？\r\n 女客人坐在自己的身后，一直没有说话，从上车到现在眼睛一直盯着窗外。张宏却感觉到一股阴冷从女人的身上散发出来，凉飕飕的。\r\n 但他没有想那么多。车子在北偏坡的山坳中颠过来倒过去地前行着，路途不是太平坦，车子行着也不是太顺心。\r\n 车左拐右拐，拐过了很多个弯，越走道路越僻静，人烟也越来越稀少。山坳里静的出奇，只有偶尔传来一两声猫头鹰的啼哭声\r\n 呜呜张宏听得毛骨悚然。比这更让他心拔凉的是女人的喘息声，有点古怪，若有若无，不像是一个正常人的呼吸节奏。\r\n 张宏只觉得后背有些发凉，终于女人说话了，嗯，到了，下车，钱。女人一字一顿，言简意赅，多余的话也不说。\r\n 张宏想这真是个奇怪的女人，回过头去，准备接女人递过来的车费。却突然发现，不知什么时候，女人换了一套白衣，披头散发，脸色是一种病态的惨白。空洞地眼睛直勾勾地盯着转过来的张宏。要，还是，不要？女人说。声音凄厉，微有愠色。\r\n 张宏哆哆嗦嗦地接过女人纤细地手指上捻着的一张100元，却发现竟然是一张冥币。她的声音幽冷的能结成冰，开门，我下去。女人还是多余的词也没有了。\r\n 女人下车后，张宏大气也不敢出，心突突地过着电。等女人走远了，张宏打开了马达，比刚才开着更快，车没命地奔跑起来，像荒原上的野马。\r\n 回到家后，张宏大病不起，一连好几天都会想起那么惊悚的一幕，在脑海中一遍又一遍的回放着。他是个无神论者，不相信这个世界上有鬼魂一说，可那晚发生的事他解释不通。\r\n 张宏将自己的遭遇告诉了女友陈晴，她也说：这世界上根本没有鬼，一定是你的幻觉。张宏宁可相信这真的是幻觉，不是发生在自己生活中的现实。\r\n 但此时陈晴却沉默了，眼睛骨碌碌地转着。我们努力的这么多年，还是住在这几平米的地方，你不觉得很凄凉？她问张宏。\r\n 张宏不知道女友怎么会提起这个问题，但一想到自己这么多年来一直亏欠着陈晴，神色窘迫起来，嗯，让你跟着我一起受罪了，我也是没法子，开出租车又能挣几个钱。他满怀歉意地看着陈晴。\r\n 陈晴搂着张宏说，现在有个法子，可以很容易赚到钱，你赚不赚？\r\n 张宏立马有了兴趣，坐直了点，催促道：什么法子，你快说？她趴在张宏的耳边把她的方法说了一遍。张宏脸上掠过惊慌的表情，但他故作镇定地反问陈晴：这这方子能行吗？\r\n 不试怎么知道。于是二人谋划了起来。\r\n 夜晚，也是12后，张宏在路边拦下了一辆车租车，向女司机说了一个地址。车子绝尘而去，在驶过一个坟茔地时，张宏叫司机停了车，说我到了，给你钱。\r\n 女司机转过头来，正准备收钱，却发现张宏的脸上血红的一片，鲜血顺着额角流了下来，濡湿了衣衫。不知何时，张宏换上了一套人死时才穿的衣服。那种青灰色的葬衣。\r\n 女司机脸惨白的一片，瑟瑟发抖地看着这诡异的一幕，缩着身子往方向盘的地方躲。张宏却阴恻恻地笑了起来，露出嘴中的獠牙来，怎么，我的样子很恐怖吗？说着，伸出了双手，作出一个要掐人的样子。\r\n 女司机惨呼一声，双眼翻白，晕了过去。\r\n 张宏将女司机拖下了车，将车开到一个偏僻的民居里。陈晴走了出来，说怎么样，我说容易吧。他点点头，走过去，抱着女友进了房子。\r\n 房间的设施很简陋，没有桌子没有床，只有一把椅子，上面放着一台笔记本电脑。陈晴已经在58同城上发了帖子，她说，朋友罹患恶疾，急需一笔医药费，有心将旧车从出售，望好心人半买半捐，施舍一点爱心。\r\n 张宏和陈晴用这样的方法做成了几笔买卖，日子立马阔了起来。\r\n 又是一个夜晚，一个看上去很实诚的男子堵住了一俩出租车，声称自己要去小南山探亲。\r\n 司机是个少妇，有点姿色，风韵犹存。当出租车拐进一个小巷子的时候，男子叫停了车，抬起头来对少妇说，谢谢你送我到这边，这是给你的钱。\r\n 少妇接过了钱，发现是一张50元的冥币，转过头正要发火，却看到了生平中最惊悚的一幕，男子青面獠牙的脸，白的想大理石，嘴角残留着血痕。少妇头一仰，晕了过去。\r\n 男子正准备下车，看到了少妇白皙的脸，修长的大腿，身体发热起来，又跳了上来。撒开了少妇的衣服\r\n 少妇感觉到了一丝凉意，幽幽地醒转过来，看到趴在自己身上的鬼惊怕地双手用力地朝他的脸上撕去，这一下竟然扯下了一副面具，露出一张狡黠地脸来。少妇哭喊着想要挣脱男子捆紧的双手，头向后猛地仰去，撞在了方向盘上，脑袋冒出一汩汩鲜血来\r\n 第二天，电视上新闻报道，一名估摸三十多岁的女司机，在小南山后惨遭强奸致死。\r\n 入夜，张宏开着一辆新车进了郊区的出租房，出租房地处偏僻，没多少人经过。张宏将车停在了院子里，猛按了几下喇叭，陈晴并没有出来迎接他，周围静寂一片，有点不寻常，张宏甚至能闻见一股血腥味，这种预感越来越强烈。\r\n 他屏住呼吸，猫着身子进了民居，只见床上陈晴平躺着，眼睛惊恐地望向一边，全身布满了伤痕，好像是用指甲抓破的。下身流下一片殷红的鲜血，濡湿了洁白的床单。\r\n 张宏撕心裂肺地惨呼一声，刚想跑过去，突然眼前刷地一个白影闪过，张宏惊呼出声，他认得那白影，是一个月前自己强奸了的那个女人。\r\n 张宏头闷地响起来，鬼啊他转身朝院里跑去，钻进了刚刚偷来的车子，发动了引擎，窜出了院子。\r\n 张宏没命地开着，油门加到了120码，车像头猛兽样卷起了一地的灰尘。\r\n 终于开到了市区，街上灯火通明，张宏惊惧地心缓和了下来，车速也慢了，这时一个女人走了过来，穿着黑色的衣服。\r\n 那女人二话没说，钻进了车子里。张宏想让女人下去。他一回头，头轰的一声大了，只见女人原先惨白的脸裂了开来，眼睛空洞的一片，不断地往下滴着血水。女人声音幽冷的像结成了冰，说道，我们又见面了，在北偏坡你竟然连招呼都没打。女人像在调笑着他。\r\n 但张宏此刻却突然感觉到心脏剧烈地跳动，他哀嚎一声，身体痉挛成一团，趴在方向盘上，一动不动了。\r\n 黑衣女鬼看着吓死了的张宏，冷笑着。撕下了面具，竟然是陈晴。\r\n 陈晴贴在张宏的耳边，嘲弄道：这个世界上你最不应该背叛的是女人。               更多精彩故事，请关注微信公众号：鬼爷讲鬼"}
     */

    private String showapi_res_error;
    private String showapi_res_id;
    private int showapi_res_code;
    private ShowapiResBodyBean showapi_res_body;

    public String getShowapi_res_error() {
        return showapi_res_error;
    }

    public void setShowapi_res_error(String showapi_res_error) {
        this.showapi_res_error = showapi_res_error;
    }

    public String getShowapi_res_id() {
        return showapi_res_id;
    }

    public void setShowapi_res_id(String showapi_res_id) {
        this.showapi_res_id = showapi_res_id;
    }

    public int getShowapi_res_code() {
        return showapi_res_code;
    }

    public void setShowapi_res_code(int showapi_res_code) {
        this.showapi_res_code = showapi_res_code;
    }

    public ShowapiResBodyBean getShowapi_res_body() {
        return showapi_res_body;
    }

    public void setShowapi_res_body(ShowapiResBodyBean showapi_res_body) {
        this.showapi_res_body = showapi_res_body;
    }

    public static class ShowapiResBodyBean {
        /**
         * ret_code : 0
         * currentPage : 1
         * text :  午夜，张宏还在忙碌着。
         他是一名出租车司机，夜半出车早已是家常便饭，这夜，一如既往。
         张宏抽着劣质的兰州烟，等着看有没有搭车的乘客。烟抽到最终，全是淡淡的苦涩味。他朝车窗外咳了一声，吐了浓痰。
         嘭嘭砰砰一阵急促地敲窗声。
         张宏回过头来，是一个女人，女人很年轻，穿着一袭黑衣，很神秘的样子。他扣了一些车门的关卡，门开了，女人上了车。
         去哪？张宏很职业的问道。
         往前开。是女人的回答。
         车启动了，张宏将油门踏到最大，在漆黑的夜中，尽量行驶的更远一点。这样他可以赚到更多的钱，谁叫女人说尽管往前开，不要问！，张宏是个老实人，尽管往前开着耗油。
         北偏坡在这个城市的最北端，很偏僻，尤其是半夜里去那地方，一般出租车司机都不愿意去，因为太过荒凉，也太阴森。贸贸然地，张宏却开到了北偏坡处，连他自己也不知道出于什么原因，自己怎么就开到这儿了？
         女客人坐在自己的身后，一直没有说话，从上车到现在眼睛一直盯着窗外。张宏却感觉到一股阴冷从女人的身上散发出来，凉飕飕的。
         但他没有想那么多。车子在北偏坡的山坳中颠过来倒过去地前行着，路途不是太平坦，车子行着也不是太顺心。
         车左拐右拐，拐过了很多个弯，越走道路越僻静，人烟也越来越稀少。山坳里静的出奇，只有偶尔传来一两声猫头鹰的啼哭声
         呜呜张宏听得毛骨悚然。比这更让他心拔凉的是女人的喘息声，有点古怪，若有若无，不像是一个正常人的呼吸节奏。
         张宏只觉得后背有些发凉，终于女人说话了，嗯，到了，下车，钱。女人一字一顿，言简意赅，多余的话也不说。
         张宏想这真是个奇怪的女人，回过头去，准备接女人递过来的车费。却突然发现，不知什么时候，女人换了一套白衣，披头散发，脸色是一种病态的惨白。空洞地眼睛直勾勾地盯着转过来的张宏。要，还是，不要？女人说。声音凄厉，微有愠色。
         张宏哆哆嗦嗦地接过女人纤细地手指上捻着的一张100元，却发现竟然是一张冥币。她的声音幽冷的能结成冰，开门，我下去。女人还是多余的词也没有了。
         女人下车后，张宏大气也不敢出，心突突地过着电。等女人走远了，张宏打开了马达，比刚才开着更快，车没命地奔跑起来，像荒原上的野马。
         回到家后，张宏大病不起，一连好几天都会想起那么惊悚的一幕，在脑海中一遍又一遍的回放着。他是个无神论者，不相信这个世界上有鬼魂一说，可那晚发生的事他解释不通。
         张宏将自己的遭遇告诉了女友陈晴，她也说：这世界上根本没有鬼，一定是你的幻觉。张宏宁可相信这真的是幻觉，不是发生在自己生活中的现实。
         但此时陈晴却沉默了，眼睛骨碌碌地转着。我们努力的这么多年，还是住在这几平米的地方，你不觉得很凄凉？她问张宏。
         张宏不知道女友怎么会提起这个问题，但一想到自己这么多年来一直亏欠着陈晴，神色窘迫起来，嗯，让你跟着我一起受罪了，我也是没法子，开出租车又能挣几个钱。他满怀歉意地看着陈晴。
         陈晴搂着张宏说，现在有个法子，可以很容易赚到钱，你赚不赚？
         张宏立马有了兴趣，坐直了点，催促道：什么法子，你快说？她趴在张宏的耳边把她的方法说了一遍。张宏脸上掠过惊慌的表情，但他故作镇定地反问陈晴：这这方子能行吗？
         不试怎么知道。于是二人谋划了起来。
         夜晚，也是12后，张宏在路边拦下了一辆车租车，向女司机说了一个地址。车子绝尘而去，在驶过一个坟茔地时，张宏叫司机停了车，说我到了，给你钱。
         女司机转过头来，正准备收钱，却发现张宏的脸上血红的一片，鲜血顺着额角流了下来，濡湿了衣衫。不知何时，张宏换上了一套人死时才穿的衣服。那种青灰色的葬衣。
         女司机脸惨白的一片，瑟瑟发抖地看着这诡异的一幕，缩着身子往方向盘的地方躲。张宏却阴恻恻地笑了起来，露出嘴中的獠牙来，怎么，我的样子很恐怖吗？说着，伸出了双手，作出一个要掐人的样子。
         女司机惨呼一声，双眼翻白，晕了过去。
         张宏将女司机拖下了车，将车开到一个偏僻的民居里。陈晴走了出来，说怎么样，我说容易吧。他点点头，走过去，抱着女友进了房子。
         房间的设施很简陋，没有桌子没有床，只有一把椅子，上面放着一台笔记本电脑。陈晴已经在58同城上发了帖子，她说，朋友罹患恶疾，急需一笔医药费，有心将旧车从出售，望好心人半买半捐，施舍一点爱心。
         张宏和陈晴用这样的方法做成了几笔买卖，日子立马阔了起来。
         又是一个夜晚，一个看上去很实诚的男子堵住了一俩出租车，声称自己要去小南山探亲。
         司机是个少妇，有点姿色，风韵犹存。当出租车拐进一个小巷子的时候，男子叫停了车，抬起头来对少妇说，谢谢你送我到这边，这是给你的钱。
         少妇接过了钱，发现是一张50元的冥币，转过头正要发火，却看到了生平中最惊悚的一幕，男子青面獠牙的脸，白的想大理石，嘴角残留着血痕。少妇头一仰，晕了过去。
         男子正准备下车，看到了少妇白皙的脸，修长的大腿，身体发热起来，又跳了上来。撒开了少妇的衣服
         少妇感觉到了一丝凉意，幽幽地醒转过来，看到趴在自己身上的鬼惊怕地双手用力地朝他的脸上撕去，这一下竟然扯下了一副面具，露出一张狡黠地脸来。少妇哭喊着想要挣脱男子捆紧的双手，头向后猛地仰去，撞在了方向盘上，脑袋冒出一汩汩鲜血来
         第二天，电视上新闻报道，一名估摸三十多岁的女司机，在小南山后惨遭强奸致死。
         入夜，张宏开着一辆新车进了郊区的出租房，出租房地处偏僻，没多少人经过。张宏将车停在了院子里，猛按了几下喇叭，陈晴并没有出来迎接他，周围静寂一片，有点不寻常，张宏甚至能闻见一股血腥味，这种预感越来越强烈。
         他屏住呼吸，猫着身子进了民居，只见床上陈晴平躺着，眼睛惊恐地望向一边，全身布满了伤痕，好像是用指甲抓破的。下身流下一片殷红的鲜血，濡湿了洁白的床单。
         张宏撕心裂肺地惨呼一声，刚想跑过去，突然眼前刷地一个白影闪过，张宏惊呼出声，他认得那白影，是一个月前自己强奸了的那个女人。
         张宏头闷地响起来，鬼啊他转身朝院里跑去，钻进了刚刚偷来的车子，发动了引擎，窜出了院子。
         张宏没命地开着，油门加到了120码，车像头猛兽样卷起了一地的灰尘。
         终于开到了市区，街上灯火通明，张宏惊惧地心缓和了下来，车速也慢了，这时一个女人走了过来，穿着黑色的衣服。
         那女人二话没说，钻进了车子里。张宏想让女人下去。他一回头，头轰的一声大了，只见女人原先惨白的脸裂了开来，眼睛空洞的一片，不断地往下滴着血水。女人声音幽冷的像结成了冰，说道，我们又见面了，在北偏坡你竟然连招呼都没打。女人像在调笑着他。
         但张宏此刻却突然感觉到心脏剧烈地跳动，他哀嚎一声，身体痉挛成一团，趴在方向盘上，一动不动了。
         黑衣女鬼看着吓死了的张宏，冷笑着。撕下了面具，竟然是陈晴。
         陈晴贴在张宏的耳边，嘲弄道：这个世界上你最不应该背叛的是女人。               更多精彩故事，请关注微信公众号：鬼爷讲鬼
         */

        private int ret_code;
        private String currentPage;
        private String text;

        public int getRet_code() {
            return ret_code;
        }

        public void setRet_code(int ret_code) {
            this.ret_code = ret_code;
        }

        public String getCurrentPage() {
            return currentPage;
        }

        public void setCurrentPage(String currentPage) {
            this.currentPage = currentPage;
        }

        public String getText() {
            return text;
        }

        public void setText(String text) {
            this.text = text;
        }
    }
}
